/**
 * Created by wj on 2017/5/12.
 */

//商城条款
var protocol='<div class="aui-content-padded text-format"><h4 class="aui-margin-b-10">1.您需服务的游戏帐号必须有完善的注册资料，并在订单有特殊纠纷情况下配合本站工作，若因帐号资料不完善而导致订单纠纷无法处理，将有可能对您的利益造成不必要的损失。需要服务的账号注明段位信息，否则订单出现纠纷时不受平台保护。</h4><h4 class="aui-margin-b-10">2.您的游戏帐号必须设有密码保护，否则因此引发的任何损失将由您自行承担。（注：喷塔Q不会向您索要任何有关密码保护的资料。）</h4><h4 class="aui-margin-b-10">3.若出现帐号被盗等意外情况，您须及时协助取回密码，喷塔Q将根据实际情况进行核实并予以调解、协商处理，喷塔Q享有最终裁判权和解释权。（注：极品装备或是贵重的装备请转移或绑定，喷塔Q只对您的服务角色资金安全负责。）</h4><h4 class="aui-margin-b-10">4.在服务过程中，请保持您所填写的通讯方式畅通，本站客服在联系双方时，如3小时内未取得联系，我们依据现有的证据和规则直接进行判定。</h4><h4 class="aui-margin-b-10">5.如因您自身原因造成的退单，将根据完成的服务进度扣除您相应的服务费用支付给接单者。如若未及时更改密码由此造成的损失需由您自行承担。建议需终止订单优先更改密码。</h4><h4 class="aui-margin-b-10">6.发布时间必须以订单中所选填的服务要求时间为准。（注：官方维护时间除外，如因特殊原因要求增加时间，请给对方留言协商，协商成功之后，按新约定时间开始计算。）</h4><h4 class="aui-margin-b-10">7. 发布者服务过程中可投诉事项：帐号被封停（含暂时冻结，王者荣耀被封号需提供带有游戏账号及封号原因证据及游戏账号封停页面证据）、游戏内物品（装备）被盗、被破坏，接单者未经允许动用金币，未经您允许擅自使用第三方外挂软件以及非正常手段方式进行服务，服务期间战绩差、掉段，服务过程中接单者联系客户或自称服务人员等。发布者发现接单者有上述行为时及时提供游戏中的截图进行投诉，喷塔Q会根据规则扣除接单者相应的资金对发布者进行补偿。（注：赔偿金额不超过接单者安全保证金和效率保证金上限）</h4><h4 class="aui-margin-b-10">8.服务过程中，请不要登陆服务帐号或者角色及修改游戏密码，以免影响服务进度，自行登陆服务角色及修改密码而造成异常情况发生，将不能得到保护。如确有需求，请留言给接单方，未经同意自行登陆帐号和修改密码而造成的任何损失，所有责任默认您自行承担。</h4><h4 class="aui-margin-b-10">9.接单者提交完成后，请您在48小时内修改游戏密码并确认订单完成。如您未确认完成，本站将在48小时后默认您对该笔订单确认完成。当您对完成情况不满意或有疑问时，切勿通过验收并在48小时内提交申诉，否则在本站默认完成后的任何损失由您自行承担。</h4><h4 class="aui-margin-b-10">10.如遇发布订单有写明的规则与服务规则有冲突，以服务协议为准。 有指定英雄、录制视频等特殊要求必须写在服务标题和服务要求中，若标题无特殊要求，订单出现纠纷时您的权益将不受平台保护。</h4><h4 class="aui-margin-b-10">11.因服务器回档或其他不可抗因素造成接单方无法正常完成或进度延迟的情况，接单者须提供相关证据请发单方谅解，相关追加时间等事宜须双方协商解决问题后及时在订单上留言确认。</h4><h4 class="aui-margin-b-10">12. 服务过程中如有一方需要更改服务要求或时间，请及时提交协商结果或在订单详细中留言并双方确认。其他任何方式提交的协议本站一概不予采信，您的权益也将得不到保障。</h4><h4 class="aui-margin-b-10">13.当您申诉反映问题时，请及时上传证据至留言信息中，以方便客服核实查证，未及时提供证据造成的损失平台不予承担。</h4><h4 class="aui-margin-b-10">14.提交申诉后，双方可通过留言板协商：协商达成一致，客服当班期间及时根据双方协商结果操作结算；协商无果，客服根据现有证据在3个工作日内直接操作处理。</h4><h4 class="aui-margin-b-10">15.用户之间平台联系后通过线下交易或其它平台交易，喷塔Q有权封停发单账户。</h4><h4 class="aui-margin-b-10">16.服务过程中，因接单者原因导致玩家的游戏账号被封停（含暂时冻结）、删号、被盗号将返还号主所有服务费用，并由接单者赔付不超过服务费的金额。</h4><h4 class="aui-margin-b-10">17.以上条款未尽事宜，喷塔Q享有最终解释权。</h4></div>';
//隐私政策
var privacyPolicy='<div class="aui-content-padded text-format"><h4 class="aui-text-info">引言</h4><h4>喷塔Q重视用户的隐私。您在使用我们的服务时，我们可能会收集和使用您的相关信息。我们希望通过本《隐私政策》向您说明，在使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。本《隐私政策》与您所使用的喷塔Q服务息息相关，希望您仔细阅读，在需要时，按照本《隐私政策》的指引，作出您认为适当的选择。</h4><h4 class="aui-text-darkblue"><strong>您使用或继续使用我们的服务，即意味着同意我们按照本《隐私政策》收集、使用、储存和分享您的相关信息。</strong></h4><h4 class="aui-text-info aui-margin-t-10">我们可能收集的信息</h4><h4>我们提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。</h4><h4 class="aui-text-darkblue"><strong>您提供的信息</strong></h4><h4>• 您在注册账户或使用我们的服务时，向我们提供的相关个人信息，例如电话号码、QQ号码、支付宝号或银行卡号等</h4><h4>• 您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。</h4><h4 class="aui-text-darkblue"><strong>我们获取的您的信息</strong></h4><h4>您使用服务时我们可能收集如下信息：</h4><h4>• <strong class="aui-text-darkblue">日志信息，</strong>指您使用我们的服务时，系统可能通过cookies、web beacon或其他方式自动采集的技术信息，包括：</h4><h4 class="aui-padded-l-15">○ 设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码；</h4><h4 class="aui-padded-l-15">○ 在使用我们服务时搜索或浏览的信息，例如您使用的网页搜索词语、以及您在使用我们服务时浏览或要求提供的其他信息和内容详情；</h4><h4 class="aui-text-info aui-margin-t-10">我们可能如何使用信息</h4><h4>我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：</h4><h4>• 向您提供服务；</h4><h4>• 在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；</h4><h4>• 帮助我们设计新服务，改善我们现有服务；</h4><h4>• 让您参与有关我们产品和服务的调查。</h4><h4>为了让您有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某一项服务所收集的信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的信息，可能在另一服务中用于向您提供特定内容，或向您展示与您相关的、非普遍推送的信息。如果我们在相关服务中提供了相应选项，您也可以授权我们将该服务所提供和储存的信息用于我们的其他服务。</h4><h4 class="aui-text-info aui-margin-t-10">您如何访问和控制自己的个人信息</h4><h4>我们将尽一切可能采取适当的技术手段，保证您可以访问、更新和更正自己的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障账户安全。</h4><h4 class="aui-text-info aui-margin-t-10">我们可能分享的信息</h4><h4>除以下情形外，<strong class="aui-text-darkblue">未经您同意</strong>，我们以及我们的关联公司不会与任何第三方分享您的个人信息：</h4><h4>• 我们以及我们的关联公司，可能将您的个人信息与我们的关联公司、合作伙伴及第三方服务供应商、承包商及代理（例如代表我们发出电子邮件或推送通知的通讯服务提供商、为我们提供位置数据的地图服务供应商）分享（他们可能并非位于您所在的法域），用作下列用途：</h4><h4 class="aui-padded-l-15">○ 向您提供我们的服务；</h4><h4 class="aui-padded-l-15">○ 实现“我们可能如何使用信息”部分所述目的；</h4><h4 class="aui-padded-l-15">○ 履行我们在《喷塔Q服务协议》或本《隐私政策》中的义务和行使我们的权利；</h4><h4 class="aui-padded-l-15">○ 理解、维护和改善我们的服务。</h4><h4>如我们或我们的关联公司与任何上述第三方分享您的个人信息，我们将努力确保该等第三方在使用您的个人信息时遵守本《隐私政策》及我们要求其遵守的其他适当的保密和安全措施。</h4><h4>• 随着我们业务的持续发展，我们以及我们的关联公司有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移。我们将在转移前通知您。</h4><h4>• 我们或我们的关联公司还可能为以下需要而保留、保存或披露您的个人信息：</h4><h4 class="aui-padded-l-15">○ 遵守适用的法律法规；</h4><h4 class="aui-padded-l-15">○ 遵守法院命令或其他法律程序的规定；</h4><h4 class="aui-padded-l-15">○ 遵守相关政府机关的要求；</h4><h4 class="aui-padded-l-15">○ 为遵守适用的法律法规、维护社会公共利益，或保护我们的客户、我们或我们的集团公司、其他用户或雇员的人身和财产安全或合法权益所合理必需的用途。</h4><h4 class="aui-text-info aui-margin-t-10">信息安全</h4><h4>我们仅在本《隐私政策》所述目的所必需的期间和法律法规要求的时限内保留您的个人信息。</h4><h4>我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）来保护您提供的个人信息。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。</h4><h4 class="aui-text-info aui-margin-t-10">我们可能如何收集信息</h4><h4>我们或我们的第三方合作伙伴，可能通过cookies和web beacon收集和使用您的信息，并将该等信息储存为日志信息。</h4><h4>我们使用自己的cookies和web beacon，目的是为您提供更个性化的用户体验和服务，并用于以下用途：</h4><h4>• 记住您的身份。例如：cookies和web beacon有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供的有关您的喜好或其他信息；</h4><h4>• 分析您使用我们服务的情况。例如，我们可利用cookies和web beacon来了解您使用我们的服务进行什么活动，或哪些网页或服务最受您的欢迎；</h4><h4>• 广告优化。Cookies和web beacon有助于我们根据您的信息，向您提供与您相关的广告而非进行普遍的广告投放。</h4><h4>我们为上述目的使用cookies和web beacon的同时，可能将通过cookies和web beacon收集的非个人身份信息，经统计加工后提供给广告商或其他合作伙伴，用于分析用户如何使用我们的服务，并用于广告服务。</h4><h4>我们的产品和服务上可能会有广告商或其他合作方放置的cookies和web beacon。这些cookies和web beacon可能会收集与您相关的非个人身份信息，以用于分析用户如何使用该等服务、向您发送您可能感兴趣的广告，或用于评估广告服务的效果。这些第三方cookies和web beacon收集和使用该等信息，不受本《隐私政策》约束，而是受相关使用者的隐私政策约束，我们不对第三方的cookies或web beacon承担责任。</h4><h4>您可以通过浏览器设置拒绝或管理cookies或web beacon。但请注意，如果停用cookies或web beacon，您有可能无法享受最佳的服务体验，某些服务也可能无法正常使用。同时，您还会收到同样数量的广告，但这些广告与您的相关性会降低。</h4><h4 class="aui-text-info aui-margin-t-10">我们可能向您发送的邮件和信息</h4><h4>邮件和信息推送</h4><h4>您在使用我们的服务时，我们可能使用您的信息向您的设备发送电子邮件、新闻或推送通知。如您不希望收到这些信息，可以按照我们的相关提示，在设备上选择取消订阅。</h4><h4>与服务有关的公告</h4><h4>我们可能在必要时（例如因系统维护而暂停某一项服务时）向您发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。</h4><h4 class="aui-text-info aui-margin-t-10">未成年人使用我们的服务</h4><h4>我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《隐私政策》，并建议未成年人在提交的个人信息之前寻求父母或监护人的同意和指导。</h4><h4 class="aui-text-info aui-margin-t-10">隐私政策的适用范围</h4><h4>除某些特定服务外，我们所有的服务均适用本《隐私政策》。这些特定服务将适用特定的隐私政策。<strong class="aui-text-darkblue">针对某些特定服务的特定隐私政策，将更具体地说明我们在该等服务中如何使用您的信息。</strong>该特定服务的隐私政策构成本《隐私政策》的一部分。<strong class="aui-text-darkblue">如相关特定服务的隐私政策与本《隐私政策》有不一致之处，适用该特定服务的隐私政策。</strong></h4><h4>除本《隐私政策》另有规定外，本《隐私条款》所用词语将与《喷塔Q服务协议》所定义的词语具有相同的涵义。</h4><h4 class="aui-text-info aui-margin-t-10">变更</h4><h4>我们可能适时修订本《隐私政策》的条款，该等修订构成本《隐私政策》的一部分。<strong class="aui-text-darkblue">如该等修订造成您在本《隐私政策》下权利的实质减少，我们将在修订生效前通过在主页上显著位置提示或以其他方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本《隐私政策》的约束。</strong></h4></div>';

function loginLayerBox(){//登录弹框
	layer.open({
		type: 2,
		title: false,
		area: ['100%','100%'],
		anim: 2,
		closeBtn: 0,
		isOutAnim:false,
		content: ['/view/html/LoginRegister02.html'],
		success:function(layero,index){
			//parent.layer.iframeAuto(index);//登录框高度自适应
			
			//判断是否ios终端，启用键盘时固定底部按钮
			var u = navigator.userAgent;  
			var isiOS = !!u.match(/\(i[^;]+;( U;)? CPU.+Mac OS X/); //ios终端  
			if(isiOS) {   
				layero.css({position:"absolute"})
		    }else{
		    	layero.css({position:"fixed"})
		    }
			
			var body = layer.getChildFrame('body', index);//获得弹窗body对象
			body.on("click","#hClose",function(){
				layer.close(index)
			})
			body.on("click","#protocol,#privacyPolicy",function(){
				if(this.id=="protocol"){//商城条款
					parent.layer.open({
						type:2,
						title:["商城条款","text-align:center;padding:0;font-size:16px;"],
						area:['90%','80%'],
						content:['/view/html/protocol.html'],
						shadeClose: true,
						success:function(layero,index){
							$(layero).addClass("scroll-wrapper");
						}
					});
					//parent.location.href="/view/html/protocol.html";//父元素直接跳转页面
				}else if(this.id=="privacyPolicy"){//隐私政策
					parent.layer.open({
						type:2,
						title:["隐私政策","text-align:center;padding:0;font-size:16px;"],
						area: ['90%','80%'],
						shadeClose: true,
						content:['/view/html/privacyPolicy.html'],
						success:function(layero,index){
							$(layero).addClass("scroll-wrapper");
						}
					})
				}
			})
		}
	});
}